In [1]:
import pandas as pd
import numpy as np

In [17]:
df = pd.read_csv(r'C:\Users\Usuario\Downloads\historico-nombres.zip')

In [18]:
df.dropna(inplace=True)

In [8]:
df.head()

        nombre  cantidad  anio
0        Maria       314  1922
1         Rosa       203  1922
2         Jose       163  1922
3  Maria Luisa       127  1922
4       Carmen       117  1922

In [27]:
prueba = df.loc[df.nombre.str.lower().str.contains('carlos')]['cantidad'].sum()

In [33]:
ex = df.loc[df.nombre.str.lower().str.contains('carlos')].groupby('nombre')['cantidad'].sum()

In [36]:
ex.idxmax()

'Juan Carlos'